In [ ]:
import pandas as pd
import numpy as np

PANDAS SERIES

In [ ]:
my_list = [10,20,30]
labels = ['a' , 'b' , 'c']
d = {'a' : 10 , 'b' : 20, 'c' : 30}

In [ ]:
pd.Series(my_list , labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
sales = pd.Series(data = [100,200,230,240] , index = ["India" , "Japan" , "China" , "USA"])
sales

India    100
Japan    200
China    230
USA      240
dtype: int64

In [ ]:
sales["Japan"]

200

In [ ]:
sales[0]

100

DATAFRAMES

In [ ]:
columns = ['W' , 'X' , 'Y' , 'Z']
index = ['A' , 'B' , 'C' , 'D' , 'E'] 
from numpy.random import randint
data  = randint(-100 , 100 , (5,4))

In [ ]:
df = pd.DataFrame(data , index , columns)
df

    W   X   Y   Z
A  -8  16 -88 -11
B -88 -59 -99 -57
C  56 -14   2  21
D  57 -82  36  61
E -33 -90 -48 -83

In [ ]:
df[["W"]]

    W
A  -8
B -88
C  56
D  57
E -33

In [ ]:
df[["W" , "Y"]]

    W   Y
A  -8 -88
B -88 -99
C  56   2
D  57  36
E -33 -48

In [ ]:
df["new"] = df["W"] + df["Z"]

In [ ]:
df

    W   X   Y   Z  new
A  -8  16 -88 -11  -19
B -88 -59 -99 -57 -145
C  56 -14   2  21   77
D  57 -82  36  61  118
E -33 -90 -48 -83 -116

In [ ]:
df = df.drop("new" , axis = 1)

LOC FUNCTION

In [ ]:
df.loc["A"]

W    -8
X    16
Y   -88
Z   -11
Name: A, dtype: int64

In [ ]:
df.loc[["A" , "E"]]

    W   X   Y   Z
A  -8  16 -88 -11
E -33 -90 -48 -83

In [ ]:
ILOC FUNCTION: CALLING THE ROWS USING THE INTEGER INDEX VALUES.

In [ ]:
df.iloc[0]

W    -8
X    16
Y   -88
Z   -11
Name: A, dtype: int64

In [ ]:
df.reset_index()

  index   W   X   Y   Z
0     A  -8  16 -88 -11
1     B -88 -59 -99 -57
2     C  56 -14   2  21
3     D  57 -82  36  61
4     E -33 -90 -48 -83

In [ ]:
df.set_index("W")

      X   Y   Z
W
-8   16 -88 -11
-88 -59 -99 -57
 56 -14   2  21
 57 -82  36  61
-33 -90 -48 -83

In [ ]:
df.describe()

               W          X          Y         Z
count   5.000000   5.000000   5.000000   5.00000
mean   -3.200000 -45.800000 -39.400000 -13.80000
std    61.706564  45.466471  57.851534  58.02758
min   -88.000000 -90.000000 -99.000000 -83.00000
25%   -33.000000 -82.000000 -88.000000 -57.00000
50%    -8.000000 -59.000000 -48.000000 -11.00000
75%    56.000000 -14.000000   2.000000  21.00000
max    57.000000  16.000000  36.000000  61.00000

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int64
 1   X       5 non-null      int64
 2   Y       5 non-null      int64
 3   Z       5 non-null      int64
dtypes: int64(4)
memory usage: 360.0+ bytes

In [ ]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object

DEALING WITH THE MISSING DATA USING PANDAS

In [ ]:
df = pd.DataFrame({"A" : [1 , 2 , np.nan , 4],
                   "B" : [5 , np.nan , np.nan , 8],
                   "C" : [10 , 20 , 30 , 40]})

In [ ]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [ ]:
df.dropna(axis = 1)

    C
0  10
1  20
2  30
3  40

In [ ]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

In [ ]:
df.dropna(axis = 1,thresh = 2)

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [ ]:
df.dropna(axis = 1,thresh = 3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

FILLING THE MISSING VALUES

In [ ]:
df.fillna(value = "any_value")

           A          B   C
0          1          5  10
1          2  any_value  20
2  any_value  any_value  30
3          4          8  40

In [ ]:
df.fillna(value= 0)

     A    B   C
0  1.0  5.0  10
1  2.0  0.0  20
2  0.0  0.0  30
3  4.0  8.0  40

In [ ]:
df["A"] = df["A"].fillna(value = 0)
df["A"]

0    1.0
1    2.0
2    0.0
3    4.0
Name: A, dtype: float64

In [ ]:
df["B"] = df["B"].fillna(value = df["B"].mean())
df["B"]

0    5.0
1    6.5
2    6.5
3    8.0
Name: B, dtype: float64

GROUP BY FUNCTION

In [ ]:
df = pd.read_csv("Universities.csv")
df.head()

                                 Sector  ... Geography
0            Private for-profit, 2-year  ...    Nevada
1  Private for-profit, less-than 2-year  ...    Nevada
2  Private for-profit, less-than 2-year  ...    Nevada
3  Private for-profit, less-than 2-year  ...    Nevada
4               Public, 4-year or above  ...    Nevada

[5 rows x 5 columns]

In [ ]:
df.groupby("Year").sum()

      Completions
Year
2012        20333
2013        21046
2014        24730
2015        26279
2016        26224

In [ ]:
df.groupby("Year").mean().sort_index(ascending = False)

      Completions
Year
2016   609.860465
2015   597.250000
2014   588.809524
2013   526.150000
2012   535.078947

In [ ]:
df.groupby(["Year" , "Sector"]).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [ ]:
df.groupby("Year").describe().transpose()

Year                      2012         2013  ...         2015         2016
Completions count    38.000000    40.000000  ...    44.000000    43.000000
            mean    535.078947   526.150000  ...   597.250000   609.860465
            std    1036.433239  1040.474782  ...  1183.371791  1235.952796
            min      13.000000     0.000000  ...     0.000000     0.000000
            25%     114.250000    98.500000  ...    87.750000    90.000000
            50%     229.500000   189.000000  ...   191.000000   208.000000
            75%     420.500000   413.000000  ...   405.750000   414.000000
            max    5388.000000  5278.000000  ...  5335.000000  5367.000000

[8 rows x 5 columns]

In [ ]:
df_one = pd.DataFrame({"k1" : ["A","A","B","B","C","C"] , 
                       "col1" : [100 , 200 , 300 , 300 , 400 , 500],
                       "col2" : ["CA" , "NY" , "WA" , "WA" , "AK" , "NV"]})

In [ ]:
df_one

  k1  col1 col2
0  A   100   CA
1  A   200   NY
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
df_one["col2"].unique()

array(['CA', 'NY', 'WA', 'AK', 'NV'], dtype=object)

In [ ]:
df_one["col2"].nunique()

5

In [ ]:
df_one["col2"].value_counts()

WA    2
NY    1
NV    1
CA    1
AK    1
Name: col2, dtype: int64

In [ ]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   CA
1  A   200   NY
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [ ]:
def grab_first_letter(state):
  return state[0]
df_one["First Letter"] = df_one["col2"].apply(grab_first_letter)

In [ ]:
df_one

  k1  col1 col2 First Letter
0  A   100   CA            C
1  A   200   NY            N
2  B   300   WA            W
3  B   300   WA            W
4  C   400   AK            A
5  C   500   NV            N

In [ ]:
my_map = {"A" : 1 , "B" : 2 , "C" : 3}
df_one["num"] = df_one["k1"].map(my_map)

In [ ]:
df_one

  k1  col1 col2 First Letter  num
0  A   100   CA            C    1
1  A   200   NY            N    1
2  B   300   WA            W    2
3  B   300   WA            W    2
4  C   400   AK            A    3
5  C   500   NV            N    3

In [ ]:
df_one["col1"].idxmin()

0

In [ ]:
df_one.sort_values("First Letter" , ascending=False)

  k1  col1 col2 First Letter  num
2  B   300   WA            W    2
3  B   300   WA            W    2
1  A   200   NY            N    1
5  C   500   NV            N    3
0  A   100   CA            C    1
4  C   400   AK            A    3

In [ ]:
features = pd.DataFrame({"A" : [1,23,34,45], "B" : [365,56,675,7]})
pred = pd.DataFrame({"predications" : [0,1,1,0]})
pd.concat([features , pred] , axis = 1)

    A    B  predications
0   1  365             0
1  23   56             1
2  34  675             1
3  45    7             0

In [ ]:
#ONE HOT ENCODING USING PANDAS
print(df_one["col1"])
print(pd.get_dummies(df_one["col1"]))

0    100
1    200
2    300
3    300
4    400
5    500
Name: col1, dtype: int64
   100  200  300  400  500
0    1    0    0    0    0
1    0    1    0    0    0
2    0    0    1    0    0
3    0    0    1    0    0
4    0    0    0    1    0
5    0    0    0    0    1